In [1]:
# üìö Basic libraries
import pandas as pd # data manipulation
import numpy as np # numerical operations
from getpass import getpass # get password without showing it
from sqlalchemy import create_engine, text # SQL connection
import pymysql # MySQL connection
import requests # HTTP requests
import time # time operations

# ‚öôÔ∏è Settings
pd.set_option('display.max_columns', None) # display all columns

In [3]:
def create_connection():
    password = getpass("Please, insert your password: ")

    db_url = f"mysql+pymysql://root:{password}@localhost/"

    engine = create_engine(db_url)
    connection = engine.connect()

    if connection:
        print("Connection successfully opened.\n")

        databases = connection.execute(text("SHOW DATABASES"))
        print("Available databases:")
        db_list = [db[0] for db in databases.fetchall()]
        for db in db_list:
            print(f"- {db}")
        return connection, db_list
    else:
        print("Failed to open connection.")
        return None

In [4]:
connection, db_list = create_connection()

Connection successfully opened.

Available databases:
- appledb
- bank
- information_schema
- iss_db_test
- lab_mysql
- librarydb
- linux
- mysql
- northwind
- nyc_311_db
- performance_schema
- publications
- sakila
- sys
- titanic

In [17]:
def select_database(connection, db_list):
    while True:
        database = input("Please, insert the name of the database you want to use: ")
        if database in db_list:
            print(f"The database {database} have been selected.")
            connection.execute(text(f"USE {database}"))
            break
        else:
            print(f"Invalid database name. Please enter a valid database from the list.")
            for db in db_list:
             print(f"- {db}")
             database = input("Try again: ").strip()

In [18]:
select_database(connection, db_list)

The database sakila have been selected.

In [19]:
def execute_query(connection, query):
    try:
        result = pd.read_sql(query, connection)
        print(f"Query '{query}' executed successfully.")
        return result
    except Exception as e:
        print(f"Error executing query: {e}")
        return None

In [20]:
query = 'SHOW TABLES'

In [21]:
tables = execute_query(connection, query)
tables

Query 'SHOW TABLES' executed successfully.

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [30]:
query = 'SELECT * FROM rental LIMIT 10'
rentals = execute_query(connection, query)
rentals

Query 'SELECT * FROM rental LIMIT 10' executed successfully.

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53

In [32]:
def rentals_month(connection, month, year):
    if not (1 <= month <= 12):
        raise ValueError("Month must be an integer between 1 and 12")
    if not isinstance(year, int):
        raise ValueError("Year must be an integer")
    
    query = text(f"""
    SELECT *
    FROM
        rental
    WHERE
        MONTH(rental_date) = {month}
        AND YEAR(rental_date) = {year}
    """)

    rental_data = pd.read_sql(query, connection, params={"month": month, "year": year})

    return rental_data, month, year

In [33]:
rental_data_may_2022, month, year = rentals_month(connection, 5, 2005)
rental_data_may_2022.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [34]:
def rental_count_month(rentals_df, month, year):

    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=f"rentals_{month:02d}_{year}")
    return rental_counts

In [35]:
rental_counts = rental_count_month(rental_data_may_2022, month, year)
rental_counts.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [41]:
def compare_rentals(connection, month1, year1, month2, year2):

    column_name1 = f"rentals_{month1:02d}_{year1}"
    column_name2 = f"rentals_{month2:02d}_{year2}"

    df1, _, _ = rentals_month(connection, month1, year1)
    df2, _, _ = rentals_month(connection, month2, year2)

    rental_counts1 = rental_count_month(df1, month1, year1)
    rental_counts2 = rental_count_month(df2, month2, year2)

    combined_df = pd.merge(rental_counts1, rental_counts2, on='customer_id', how='outer')
    combined_df = combined_df.fillna(0)

    # Calculate the difference between the two rental counts
    combined_df['difference'] = abs(combined_df[column_name1] - combined_df[column_name2])
    
    return combined_df

In [42]:
combined_df = compare_rentals(connection, 5, 2005, 6, 2005)
combined_df.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1              2.0              7.0         5.0
1            2              1.0              1.0         0.0
2            3              2.0              4.0         2.0
3            4              0.0              6.0         6.0
4            5              3.0              5.0         2.0